{
    "team": [
        {
            "image": "team-01",
            "name": "David Lighton",
            "position": "Cofounder/CEO",
            "description": "David Lighton is SendFriend's Co-Founder and CEO. David developed the concept for SendFriend in 2017 while getting his MBA from MIT Sloan's full-time program. David stewarded his early team into MIT's delta V Accelerator and Barclays Accelerator TechStars.",
            "id": "david",
            "link": "/leadership#david",
            "bio": "David Lighton is SendFriend's Co-Founder and CEO. David developed the concept for SendFriend in 2017 while getting his MBA from MIT Sloan's full-time program. David stewarded his early team into MIT's delta V Accelerator and Barclays Accelerator TechStars. In the process, he sourced pre-seed funding for the venture from leading sources including the European Union Smart Growth fund, Ripple, MIT Media Lab, Knick Capital, and 8 Decimal Capital. Prior to SendFriend and Sloan, David was an analyst for five years at the World Banks Haiti desk in Washington, DC, where he served on the Special Envoy's staff overseeing an $800M investment portfolio for earthquake reconstruction.Since 2019, David has been a Yale Global Justice Fellow, appointed to conduct and advise on research related to cross-border payments and blockchain. He also sits on the Johns Hopkins University Dean's Advisory Board. Additionally, David is a Co-Founder of Lithium Finance, a blockchain platform designed to value private assets via the wisdom of crowds and algorithms. David holds his MBA from MIT Sloan, MA from John Hopkins School of International Studies (SAIS) with honors, and BA in International Studies from Johns Hopkins University.",
            "column": "col-lg-3"
        },
        {
            "image": "team-04",
            "name": "Satwik Seshasai",
            "position": "Board Director",
            "description": "Satwik Seshasai is the head of AI Infrastructure Engineering at Compass. Previously he served as CTO at ShopSpring, an e-commerce business. He is the co-founder of Segovia Technology, an international payments platform, which was backed by Greylock Partners",
            "id": "satwik",
            "link": "/leadership#satwik",
            "bio": "Satwik Seshasai is the head of AI Infrastructure Engineering at Compass. Previously he served as CTO at ShopSpring, an e-commerce business. He is the co-founder of Segovia Technology, an international payments platform, which was backed by Greylock Partners and was recently acquired by Crown Agents Bank and Helios Partners. He holds a PhD from MIT.",
            "column": "col-lg-3"
        },
        {
            "image": "team-03",
            "name": "Sandra Ro",
            "position": "Board Director",
            "description": "Sandra Ro is the current CEO of the Global Blockchain Business Council, and a recognized thought leader in the blockchain space, having built blockchain-based products at the Chicago Mercantile Exchange. She holds a BA from Yale and an MBA from the London Business School.",
            "id": "sandra",
            "link": "/leadership#sandra",
            "bio": "Sandra Ro is the current CEO of the Global Blockchain Business Council, and a recognized thought leader in the blockchain space, having built blockchain-based products at the Chicago Mercantile Exchange. She holds a BA from Yale and an MBA from the London Business School.",
            "column": "col-lg-3 max-w-20"
        },
        {
            "image": "team-05",
            "name": "Rafal Petsch",
            "position": "General Manager of Polish Operations",
            "description": "Rafal Petsch is SendFriend's General Manager of its Polish subsidiary. He boasts over 25 years of experience working in the international banking sector.  He started his career in 1994 in the Treasury Department of the Warsaw branch of ING bank.",
            "id": "rafal",
            "link": "/leadership#rafal",
            "bio": "Rafal Petsch is SendFriend's General Manager of its Polish subsidiary. He boasts over 25 years of experience working in the international banking sector. He started his career in 1994 in the Treasury Department of the Warsaw branch of ING bank. Afterwards, he spent 5 years with Bank of America Group, where, he co-founded the BOA Warsaw branch, held the positions of Chief Trader, Treasurer and Member of the Management Board. At BoA in London, Rafal was the head of the Exotic Currencies team, and later managed PLN currency positions at Citibank N.A.&nbsp;&nbsp;After returning to Poland, he was appointed Director of the Treasury Department at DZ Bank Polska. In 2004, he became Head of the Treasury and Investment Finance Department at the newly established Dexia Kommunalredit Bank.&nbsp;&nbsp;The remainder of his banking career was spent developing the Pekao S.A. group (Unicredit), the largest corporate bank in Poland.&nbsp;&nbsp;Since 2009, he has held the position of Managing Director of the Financial Institutions and Public Sector Department, Managing Director of the Strategic Clients Department, as well as was a member of the Management Board of Pekao Investement Banking S.A.&nbsp;&nbsp;He was also the head of two strategic projects (Go Poland and Agromania), and was an active member of the banks credit committee. Since January 2021, he has been a Managing Director at Ipopema Securities. Rafal is also one of the founding members of PLUS Connector - a platform that supports innovative US companies with their expansion into Polish and European Markets. He also holds a Board Member position at Sendfriend Polska Sp. z o.o. He is a graduate of INSEAD, as well as the Warsaw School of Economics.",
            "column": "col-lg-3 max-w-20"
        },
        {
            "image": "team-06",
            "name": "Natasha Kuzman",
            "position": "Director of Digital",
            "description": "Natasha Kuzman joined SendFriend as Director of Digital in 2021 to define technology direction and execution of the Digital strategy that will power SendFriend's blockchain-enabled payment platform, enabling B2B payments across borders.",
            "id": "natasha",
            "link": "/leadership#natasha",
            "bio": "Natasha Kuzman joined SendFriend as Director of Digital in 2021 to define technology direction and execution of the Digital strategy that will power SendFriend's blockchain-enabled payment platform, enabling B2B payments across borders. Natasha is the founder of IWC, a marketing strategy firm based in London. She has been driving creative direction and digital transformation for over 350 brands, such as MailOnline, YOU Magazine, Metro, Hertz, Irish Post, British Airlines; and has been helping enterprises automate their digital infrastructure for maximal growth.   Natasha holds a Diploma in Professional Marketing at the Chartered Institute of Marketing in London and a Master's Degree in Software Technologies from the NBU University in Sofia, Bulgaria. For her final thesis she built an Online Grading System that was later used in some high schools in North Macedonia to support digital education in 2011.",
            "column": "col-lg-3 max-w-20"
        },
        {
            "image": "team-02",
            "name": "Michal Czaja",
            "position": "Director of Engineering",
            "description": "Michał has wide experience in IT gained in a broad spectrum of industries. He has been working in every level of the software development process and had the opportunity to try a variety of approaches and architectures designs",
            "id": "michal",
            "link": "/leadership#michal",
            "bio": "Michał has wide experience in IT gained in a broad spectrum of industries. He has been working in every level of the software development process and had the opportunity to try a variety of approaches and architectures designs in different sized companies, from startups to international corporations. Inter alia he worked for companies such as British HSBC Holdings, American Sabre Corporation, German Daimler, BSH or Saud Arabia ELM information security. Michał has also a deep understanding of use cases in Data Science, Machine Learning, AI and block chain technologies where he popularized and applied his knowledge within the  companies he worked for. He graduated in science at Jagiellonian University in Poland.",
            "column": "col-lg-3 max-w-20"
        },
        {
            "image": "team-08",
            "name": "Robert Rudko",
            "position": "Cloud Infrastructure Engineer",
            "description": "Robert Rudko is a cloud and software engineer with experience in multiple financial software projects, from corporate finance platforms to virtual banks.",
            "id": "robert",
            "link": "/leadership#robert",
            "bio": "Robert Rudko is a cloud and software engineer with experience in multiple financial software projects, from corporate finance platforms to virtual banks. He is responsible for building a reliable and secure platform that Sendfriend operates on. As a quality-focused holder of 8 AWS certifications, he ensures that the product performs in the best possible manner.",
            "column": "col-lg-3 max-w-20"
        },
        {
            "image": "team-07",
            "name": "Natalia Sakowicz",
            "position": "Financial Expert",
            "description": "Natalia graduated in European administration from Cardinal Stefan Wyszyński University. She gained her professional experience in the European parliament, insurance company",
            "id": "natalia",
            "link": "/leadership#natalia",
            "bio": "Natalia graduated in European administration from Cardinal Stefan Wyszyński University. She gained her professional experience in the European parliament, insurance company, financial institutions as well as in a law firm. Recently, she joined Sendfriend as a financial expert.",
            "column": "col-lg-3 max-w-20"
        }
    ]
}